################################################################################
# Brew Bundle                                                                  #
# https://github.com/Homebrew/homebrew-bundle                                  #
################################################################################

################################################################################
# Taps (directories of formulae, casks, fonts, ...)                            #
# `brew tap <tap_name>`                                                        #
################################################################################
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

################################################################################
# Fonts (are actually casks)                                                   #
# `brew install --cask <cask_name>`                                            #
################################################################################
cask "font-fontawesome"
cask "font-open-sans"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-for-powerline"
cask "font-powerline-symbols"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-roboto-mono-nerd-font"

################################################################################
# Mac App Store                                                                #
# `mas install <app_name>`                                                     #
# Note: you must be signed into the AppStore                                   #
################################################################################

# Utilities
mas "Commander One",        id: 1035236694
mas "LastPass",             id: 926036361
mas "Magnet",               id: 441258766
mas "Surfshark",            id: 1437809329
mas "Toggl Track",          id: 957734279

# Productivity (office tools)
mas "Microsoft Excel",      id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word",       id: 462054704
mas "Trello",               id: 1278508951

# Communication/Social
mas "Messenger",            id: 1480068668
mas "Slack",                id: 803453959
mas "WhatsApp",             id: 1147396723

# Other 
mas "iMovie",               id: 408981434
mas "Xcode",                id: 497799835
